recept/src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукции</name>
  <basedOn>Document.Рецептуры</basedOn>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <registerRecords>InformationRegister.ЦеныМатериалов</registerRecords>
  <registerRecords>InformationRegister.СтатусПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Рецептуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>НаменованиеПродукции</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОбеспечения</name>
      <type>
        <types>EnumRef.СтатусыГотовностиПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/InformationRegisters/ЦеныМатериалов/ЦеныМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныМатериалов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

recept/src/AccumulationRegisters/ОстаткиМатериалов/ОстаткиМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериалов</name>
  <resources>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/AccumulationRegisters/СтоимостьМатериалов/СтоимостьМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьМатериалов</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/InformationRegisters/СтатусПродукции/СтатусПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусПродукции</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыГотовностиПродукции</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

recept/src/Enums/СтатусыГотовностиПродукции/СтатусыГотовностиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыГотовностиПродукции</name>
  <enumValues>
    <name>Заявка</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Брак</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
</mdclass:Enum>

recept/src/Documents/ВыпускПродукции/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ЦеныМатериалов.Записывать = Истина;
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.СтоимостьМатериалов.Записывать = Истина; 
 	Движения.СтатусПродукции.Записывать = Истина;

	Для Каждого ТекСтрокаПродукция Из Продукция Цикл
		Движение = Движения.ЦеныМатериалов.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаПродукция.НаменованиеПродукции;
		Движение.Цена = ТекСтрокаПродукция.Цена;

		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаПродукция.НаменованиеПродукции;
		Движение.Остаток = ТекСтрокаПродукция.Количество;   
		
		// регистр СтоимостьМатериалов Приход	
		Движение = Движения.СтоимостьМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Материал = ТекСтрокаПродукция.НаменованиеПродукции;
		Движение.Стоимость = ТекСтрокаПродукция.Количество * ТекСтрокаПродукция.Цена;    
		
 		Движение = Движения.СтатусПродукции.Добавить();
		Движение.Период = ТекущаяДата();
		Движение.Номенклатура = ТекСтрокаПродукция.НаменованиеПродукции;
		Движение.Статус = ТекСтрокаПродукция.СостояниеОбеспечения; 
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Рецептуры") Тогда
		НомерДокументаОснования = ДанныеЗаполнения.Наименование;
		Примечание = ДанныеЗаполнения.Примечание;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаПродукция Из ДанныеЗаполнения.Продукция Цикл  
			Если ТекСтрокаПродукция.СостояниеОбеспечения = Перечисления.СтатусыГотовностиПродукции.ВРаботе Тогда
				НоваяСтрока = Продукция.Добавить();
				НоваяСтрока.Количество = ТекСтрокаПродукция.Количество;
				НоваяСтрока.НаменованиеПродукции = ТекСтрокаПродукция.Наименование;
				НоваяСтрока.СостояниеОбеспечения = Перечисления.СтатусыГотовностиПродукции.ГотовКОтгрузке;
				НоваяСтрока.Цена = ТекСтрокаПродукция.Цена;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
